## Adam Pithenwala

0901AD211003

## Titanic Problem

In [5]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [6]:
data = pd.read_csv("./titanic_train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
print(data.columns.values)

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

In [8]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
data.describe(include=['O'])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

### Relation between Sex and Survived

In [13]:
data[['Sex', 'Survived']].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

### Relation between Embarked and Survived

In [14]:
data[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean().sort_values(by='Survived', ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957

### Relation between Pclass and Survived

In [35]:
data.pivot_table(index=["Sex"], columns=['Pclass'], values=['Survived'], aggfunc='count')

       Survived
Pclass        1    2    3
Sex
female       94   76  144
male        122  108  347

#### Total Females

In [32]:
data['Sex'].tolist().count('female')

314

#### Total males

In [31]:
data['Sex'].tolist().count('male')

577

#### Survived gender in different classes

In [36]:
data[data['Survived']==1].groupby(['Sex','Pclass']).size().reset_index(name='count')

      Sex  Pclass  count
0  female       1     91
1  female       2     70
2  female       3     72
3    male       1     45
4    male       2     17
5    male       3     47

#### Died gender in different classes

In [37]:
data[data['Survived']==0].groupby(['Sex','Pclass']).size().reset_index(name='count')

      Sex  Pclass  count
0  female       1      3
1  female       2      6
2  female       3     72
3    male       1     77
4    male       2     91
5    male       3    300

#### People that survived from different embarked

In [39]:
data[data['Survived']==1].groupby(['Embarked']).size().reset_index(name='count')

  Embarked  count
0        C     93
1        Q     30
2        S    217

#### Total number of null values in age

In [44]:
data['Age'].isnull().sum()

177

In [68]:
index_sum = data[data['Age'].isna()]
index_sum["PassengerId"].sum()

77098